valleywine/app/controllers/comments_controller.rb

SELECT "posts".* FROM "posts" WHERE ("posts"."id" = 1) LIMIT 1
INSERT INTO "comments" ("body", "commenter", "created_at", "post_id", "updated_at") VALUES ('Scott''s first comment. Scott''s first comment. Scott''s first comment. Scott''s first comment. Scott''s first comment. Scott''s first comment. Scott''s first comment. Scott''s first comment. Scott''s first comment. Scott''s first comment. Scott''s first comment. Great blog dude!', 'Scott Commenter', '2011-01-25 01:33:36.484747', 1, '2011-01-25 01:33:36.484747')
---
  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.create(params[:comment])